In [4]:
l1 = [1,12,3,4,5]
l2 = l1[::-1]

In [5]:
l2

[5, 4, 3, 12, 1]

In [11]:
data_dict ={'name':"Himanshu",'age':28,'designation':'DAta Engineer'}

In [12]:
data_dict['Marital_status']='single'

In [13]:
data_dict

{'name': 'Himanshu',
 'age': 28,
 'designation': 'DAta Engineer',
 'Marital_status': 'single'}

In [15]:
data_dict.popitem()

('Marital_status', 'single')

In [18]:
data_dict

{'name': 'Himanshu', 'age': 28, 'designation': 'DAta Engineer'}

In [21]:
data_dict.get('first_name','No such field')

'No such field'

In [22]:
squares = [x**2 for x in range(5)]

In [23]:
squares

[0, 1, 4, 9, 16]

In [24]:
del data_dict['name']

In [25]:
data_dict

{'age': 28, 'designation': 'DAta Engineer'}

In [26]:
my_tuple = (1,2,3)
a,b,c = my_tuple
print(a)
print(b)
print(c)

1
2
3

In [27]:
my_dict = dict.fromkeys(l1,0)

In [28]:
my_dict

{1: 0, 12: 0, 3: 0, 4: 0, 5: 0}

In [31]:
my_dict['12']

KeyError: '12'

In [32]:
my_list = ['a', 'b', 'c']
my_dict = {item: len(item) for item in my_list}  # Creates a dictionary with values based on length
my_dict

{'a': 1, 'b': 1, 'c': 1}

In [35]:
data = [('Name',"Himanshu"),("age",28),("designation","Data Engineer")]
info_dict = dict(data)

In [36]:
info_dict

{'Name': 'Himanshu', 'age': 28, 'designation': 'Data Engineer'}

In [37]:
my_list = []
my_list.append(info_dict)

In [38]:
my_list

[{'Name': 'Himanshu', 'age': 28, 'designation': 'Data Engineer'}]

In [40]:
# Create a sample dataset
import pandas as pd
data = {
    "Date": ["2023-09-01", "2023-09-02", "2023-09-03", "2023-09-04", "2023-09-05"],
    "Product": ["A", "B", "A", "C", "B"],
    "Price": [100, 200, 100, 300, 200],
    "Quantity": [1, 2, 3, 1, 2]
}

# Convert the dictionary to a pandas DataFrame
df = pd.DataFrame(data)

In [41]:
#============================================================================================

#Here are 10 interview questions about Pandas, made to cover everything from simple tasks to more tricky ones,

# You have a CSV file named "sales_data.csv" containing sales information with columns: "Date", 
# "Product", "Price", "Quantity". Write the code to read this file into a Pandas DataFrame and 
# display the first 5 rows.

import pandas as pd

#df = pd.read_csv('sales_data.csv')
df.head()

         Date Product  Price  Quantity
0  2023-09-01       A    100         1
1  2023-09-02       B    200         2
2  2023-09-03       A    100         3
3  2023-09-04       C    300         1
4  2023-09-05       B    200         2

In [43]:




# Using the DataFrame created in the previous question, write a code snippet to filter out all sales records 
# for the product named "Widget A".

df_filtered = df[df['Product']=="A"]
df_filtered

         Date Product  Price  Quantity
0  2023-09-01       A    100         1
2  2023-09-03       A    100         3

In [44]:
# For the same DataFrame, calculate the total sales (Price * Quantity) for each row and 
# add this as a new column named "Total Sales".


df['Total Sales'] = df.Price * df.Quantity
df

         Date Product  Price  Quantity  Total Sales
0  2023-09-01       A    100         1          100
1  2023-09-02       B    200         2          400
2  2023-09-03       A    100         3          300
3  2023-09-04       C    300         1          300
4  2023-09-05       B    200         2          400

In [46]:

# Assuming your DataFrame has some missing values in the "Price" and "Quantity" columns, write a code 
# snippet to fill missing values in "Price" with the average price and in "Quantity" with the median quantity.


df['Price'].fillna((df['Price'].mean()), inplace=True)

df['Quantity'].fillna((df['Quantity'].median()), inplace=True)

df

         Date Product  Price  Quantity  Total Sales
0  2023-09-01       A    100         1          100
1  2023-09-02       B    200         2          400
2  2023-09-03       A    100         3          300
3  2023-09-04       C    300         1          300
4  2023-09-05       B    200         2          400

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         5 non-null      object
 1   Product      5 non-null      object
 2   Price        5 non-null      int64
 3   Quantity     5 non-null      int64
 4   Total Sales  5 non-null      int64
dtypes: int64(3), object(2)
memory usage: 328.0+ bytes

In [50]:
# Convert the "Date" column of your DataFrame to a Pandas DateTime type and then add a new column that 
# represents just the month of each sale.


df['Date']= pd.to_datetime(df['Date'])
df['month'] = df['Date'].dt.strftime('%m')
#or 
#df['month'] = df['Date'].dt.month
df

        Date Product  Price  Quantity  Total Sales month
0 2023-09-01       A    100         1          100    09
1 2023-09-02       B    200         2          400    09
2 2023-09-03       A    100         3          300    09
3 2023-09-04       C    300         1          300    09
4 2023-09-05       B    200         2          400    09

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         5 non-null      datetime64[ns]
 1   Product      5 non-null      object
 2   Price        5 non-null      int64
 3   Quantity     5 non-null      int64
 4   Total Sales  5 non-null      int64
 5   month        5 non-null      object
dtypes: datetime64[ns](1), int64(3), object(2)
memory usage: 368.0+ bytes

In [52]:

#Group your sales data by the "Product" column and calculate the total sales (sum of "Total Sales") 
#for each product.


df.groupby('Product')['Total Sales'].sum()

Product
A    400
B    800
C    300
Name: Total Sales, dtype: int64

In [56]:


#You have a second DataFrame named "product_info" with columns: "Product" and "Category".
#Write a code snippet to merge this DataFrame with your sales data on the "Product" column.

#/Users/himanshu/Downloads
df_pro = pd.read_csv('/Users/himanshu/Downloads/product_info.csv')
df_pro

  Product         Category
0       A      Electronics
1       B  Home Appliances
2       C        Furniture

In [60]:
df = df.merge(df_pro, on='Product')
df

        Date Product  Price  Quantity  Total Sales month         Category
0 2023-09-01       A    100         1          100    09      Electronics
1 2023-09-03       A    100         3          300    09      Electronics
2 2023-09-02       B    200         2          400    09  Home Appliances
3 2023-09-05       B    200         2          400    09  Home Appliances
4 2023-09-04       C    300         1          300    09        Furniture

In [62]:
# Sort your sales data by the "Total Sales" column in descending order to see which sales records had the 
# highest values.


df.sort_values('Total Sales', ascending=False,inplace=True)
df

        Date Product  Price  Quantity  Total Sales month         Category
2 2023-09-02       B    200         2          400    09  Home Appliances
3 2023-09-05       B    200         2          400    09  Home Appliances
1 2023-09-03       A    100         3          300    09      Electronics
4 2023-09-04       C    300         1          300    09        Furniture
0 2023-09-01       A    100         1          100    09      Electronics

In [65]:
#Create a pivot table from your sales data that shows the sum of "Total Sales" for each product by month.

pivot = df.pivot_table(values='Total Sales',index='Product',columns='month',aggfunc='sum',fill_value=0)

In [66]:
pivot

month     09
Product
A        400
B        800
C        300